FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/otg_reg.h
#define OTG_CTL_BUSREQ_Pos          ( 1 )                                                  /*!< OTG_T::CTL: BUSREQ Position            */
#define OTG_CTL_BUSREQ_Msk          ( 0x1ul << OTG_CTL_BUSREQ_Pos )                        /*!< OTG_T::CTL: BUSREQ Mask                */

#define OTG_CTL_HNPREQEN_Pos        ( 2 )                                                  /*!< OTG_T::CTL: HNPREQEN Position          */
#define OTG_CTL_HNPREQEN_Msk        ( 0x1ul << OTG_CTL_HNPREQEN_Pos )                      /*!< OTG_T::CTL: HNPREQEN Mask              */

#define OTG_CTL_OTGEN_Pos           ( 4 )                                                  /*!< OTG_T::CTL: OTGEN Position             */
#define OTG_CTL_OTGEN_Msk           ( 0x1ul << OTG_CTL_OTGEN_Pos )                         /*!< OTG_T::CTL: OTGEN Mask                 */

#define OTG_CTL_WKEN_Pos            ( 5 )                                                  /*!< OTG_T::CTL: WKEN Position              */
#define OTG_CTL_WKEN_Msk            ( 0x1ul << OTG_CTL_WKEN_Pos )                          /*!< OTG_T::CTL: WKEN Mask                  */

#define OTG_PHYCTL_OTGPHYEN_Pos     ( 0 )                                                  /*!< OTG_T::PHYCTL: OTGPHYEN Position       */
#define OTG_PHYCTL_OTGPHYEN_Msk     ( 0x1ul << OTG_PHYCTL_OTGPHYEN_Pos )                   /*!< OTG_T::PHYCTL: OTGPHYEN Mask           */

#define OTG_PHYCTL_IDDETEN_Pos      ( 1 )                                                  /*!< OTG_T::PHYCTL: IDDETEN Position        */
#define OTG_PHYCTL_IDDETEN_Msk      ( 0x1ul << OTG_PHYCTL_IDDETEN_Pos )                    /*!< OTG_T::PHYCTL: IDDETEN Mask            */

#define OTG_PHYCTL_VBENPOL_Pos      ( 4 )                                                  /*!< OTG_T::PHYCTL: VBENPOL Position        */
#define OTG_PHYCTL_VBENPOL_Msk      ( 0x1ul << OTG_PHYCTL_VBENPOL_Pos )                    /*!< OTG_T::PHYCTL: VBENPOL Mask            */

#define OTG_PHYCTL_VBSTSPOL_Pos     ( 5 )                                                  /*!< OTG_T::PHYCTL: VBSTSPOL Position       */
#define OTG_PHYCTL_VBSTSPOL_Msk     ( 0x1ul << OTG_PHYCTL_VBSTSPOL_Pos )                   /*!< OTG_T::PHYCTL: VBSTSPOL Mask           */

#define OTG_INTEN_ROLECHGIEN_Pos    ( 0 )                                                  /*!< OTG_T::INTEN: ROLECHGIEN Position      */
#define OTG_INTEN_ROLECHGIEN_Msk    ( 0x1ul << OTG_INTEN_ROLECHGIEN_Pos )                  /*!< OTG_T::INTEN: ROLECHGIEN Mask          */

#define OTG_INTEN_VBEIEN_Pos        ( 1 )                                                  /*!< OTG_T::INTEN: VBEIEN Position          */
#define OTG_INTEN_VBEIEN_Msk        ( 0x1ul << OTG_INTEN_VBEIEN_Pos )                      /*!< OTG_T::INTEN: VBEIEN Mask              */

#define OTG_INTEN_SRPFIEN_Pos       ( 2 )                                                  /*!< OTG_T::INTEN: SRPFIEN Position         */
#define OTG_INTEN_SRPFIEN_Msk       ( 0x1ul << OTG_INTEN_SRPFIEN_Pos )                     /*!< OTG_T::INTEN: SRPFIEN Mask             */

#define OTG_INTEN_HNPFIEN_Pos       ( 3 )                                                  /*!< OTG_T::INTEN: HNPFIEN Position         */
#define OTG_INTEN_HNPFIEN_Msk       ( 0x1ul << OTG_INTEN_HNPFIEN_Pos )                     /*!< OTG_T::INTEN: HNPFIEN Mask             */

#define OTG_INTEN_GOIDLEIEN_Pos     ( 4 )                                                  /*!< OTG_T::INTEN: GOIDLEIEN Position       */
#define OTG_INTEN_GOIDLEIEN_Msk     ( 0x1ul << OTG_INTEN_GOIDLEIEN_Pos )                   /*!< OTG_T::INTEN: GOIDLEIEN Mask           */

#define OTG_INTEN_IDCHGIEN_Pos      ( 5 )                                                  /*!< OTG_T::INTEN: IDCHGIEN Position        */
#define OTG_INTEN_IDCHGIEN_Msk      ( 0x1ul << OTG_INTEN_IDCHGIEN_Pos )                    /*!< OTG_T::INTEN: IDCHGIEN Mask            */

#define OTG_INTEN_PDEVIEN_Pos       ( 6 )                                                  /*!< OTG_T::INTEN: PDEVIEN Position         */
#define OTG_INTEN_PDEVIEN_Msk       ( 0x1ul << OTG_INTEN_PDEVIEN_Pos )                     /*!< OTG_T::INTEN: PDEVIEN Mask             */

#define OTG_INTEN_HOSTIEN_Pos       ( 7 )                                                  /*!< OTG_T::INTEN: HOSTIEN Position         */
#define OTG_INTEN_HOSTIEN_Msk       ( 0x1ul << OTG_INTEN_HOSTIEN_Pos )                     /*!< OTG_T::INTEN: HOSTIEN Mask             */

#define OTG_INTEN_BVLDCHGIEN_Pos    ( 8 )                                                  /*!< OTG_T::INTEN: BVLDCHGIEN Position      */
#define OTG_INTEN_BVLDCHGIEN_Msk    ( 0x1ul << OTG_INTEN_BVLDCHGIEN_Pos )                  /*!< OTG_T::INTEN: BVLDCHGIEN Mask          */

#define OTG_INTEN_AVLDCHGIEN_Pos    ( 9 )                                                  /*!< OTG_T::INTEN: AVLDCHGIEN Position      */
#define OTG_INTEN_AVLDCHGIEN_Msk    ( 0x1ul << OTG_INTEN_AVLDCHGIEN_Pos )                  /*!< OTG_T::INTEN: AVLDCHGIEN Mask          */

#define OTG_INTEN_VBCHGIEN_Pos      ( 10 )                                                 /*!< OTG_T::INTEN: VBCHGIEN Position        */
#define OTG_INTEN_VBCHGIEN_Msk      ( 0x1ul << OTG_INTEN_VBCHGIEN_Pos )                    /*!< OTG_T::INTEN: VBCHGIEN Mask            */

#define OTG_INTEN_SECHGIEN_Pos      ( 11 )                                                 /*!< OTG_T::INTEN: SECHGIEN Position        */
#define OTG_INTEN_SECHGIEN_Msk      ( 0x1ul << OTG_INTEN_SECHGIEN_Pos )                    /*!< OTG_T::INTEN: SECHGIEN Mask            */

#define OTG_INTEN_SRPDETIEN_Pos     ( 13 )                                                 /*!< OTG_T::INTEN: SRPDETIEN Position       */
#define OTG_INTEN_SRPDETIEN_Msk     ( 0x1ul << OTG_INTEN_SRPDETIEN_Pos )                   /*!< OTG_T::INTEN: SRPDETIEN Mask           */

#define OTG_INTSTS_ROLECHGIF_Pos    ( 0 )                                                  /*!< OTG_T::INTSTS: ROLECHGIF Position      */
#define OTG_INTSTS_ROLECHGIF_Msk    ( 0x1ul << OTG_INTSTS_ROLECHGIF_Pos )                  /*!< OTG_T::INTSTS: ROLECHGIF Mask          */

#define OTG_INTSTS_VBEIF_Pos        ( 1 )                                                  /*!< OTG_T::INTSTS: VBEIF Position          */
#define OTG_INTSTS_VBEIF_Msk        ( 0x1ul << OTG_INTSTS_VBEIF_Pos )                      /*!< OTG_T::INTSTS: VBEIF Mask              */

#define OTG_INTSTS_SRPFIF_Pos       ( 2 )                                                  /*!< OTG_T::INTSTS: SRPFIF Position         */
#define OTG_INTSTS_SRPFIF_Msk       ( 0x1ul << OTG_INTSTS_SRPFIF_Pos )                     /*!< OTG_T::INTSTS: SRPFIF Mask             */

