FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/otg_reg.h
#define OTG_INTSTS_HNPFIF_Pos       ( 3 )                                                  /*!< OTG_T::INTSTS: HNPFIF Position         */
#define OTG_INTSTS_HNPFIF_Msk       ( 0x1ul << OTG_INTSTS_HNPFIF_Pos )                     /*!< OTG_T::INTSTS: HNPFIF Mask             */

#define OTG_INTSTS_GOIDLEIF_Pos     ( 4 )                                                  /*!< OTG_T::INTSTS: GOIDLEIF Position       */
#define OTG_INTSTS_GOIDLEIF_Msk     ( 0x1ul << OTG_INTSTS_GOIDLEIF_Pos )                   /*!< OTG_T::INTSTS: GOIDLEIF Mask           */

#define OTG_INTSTS_IDCHGIF_Pos      ( 5 )                                                  /*!< OTG_T::INTSTS: IDCHGIF Position        */
#define OTG_INTSTS_IDCHGIF_Msk      ( 0x1ul << OTG_INTSTS_IDCHGIF_Pos )                    /*!< OTG_T::INTSTS: IDCHGIF Mask            */

#define OTG_INTSTS_PDEVIF_Pos       ( 6 )                                                  /*!< OTG_T::INTSTS: PDEVIF Position         */
#define OTG_INTSTS_PDEVIF_Msk       ( 0x1ul << OTG_INTSTS_PDEVIF_Pos )                     /*!< OTG_T::INTSTS: PDEVIF Mask             */

#define OTG_INTSTS_HOSTIF_Pos       ( 7 )                                                  /*!< OTG_T::INTSTS: HOSTIF Position         */
#define OTG_INTSTS_HOSTIF_Msk       ( 0x1ul << OTG_INTSTS_HOSTIF_Pos )                     /*!< OTG_T::INTSTS: HOSTIF Mask             */

#define OTG_INTSTS_BVLDCHGIF_Pos    ( 8 )                                                  /*!< OTG_T::INTSTS: BVLDCHGIF Position      */
#define OTG_INTSTS_BVLDCHGIF_Msk    ( 0x1ul << OTG_INTSTS_BVLDCHGIF_Pos )                  /*!< OTG_T::INTSTS: BVLDCHGIF Mask          */

#define OTG_INTSTS_AVLDCHGIF_Pos    ( 9 )                                                  /*!< OTG_T::INTSTS: AVLDCHGIF Position      */
#define OTG_INTSTS_AVLDCHGIF_Msk    ( 0x1ul << OTG_INTSTS_AVLDCHGIF_Pos )                  /*!< OTG_T::INTSTS: AVLDCHGIF Mask          */

#define OTG_INTSTS_VBCHGIF_Pos      ( 10 )                                                 /*!< OTG_T::INTSTS: VBCHGIF Position        */
#define OTG_INTSTS_VBCHGIF_Msk      ( 0x1ul << OTG_INTSTS_VBCHGIF_Pos )                    /*!< OTG_T::INTSTS: VBCHGIF Mask            */

#define OTG_INTSTS_SECHGIF_Pos      ( 11 )                                                 /*!< OTG_T::INTSTS: SECHGIF Position        */
#define OTG_INTSTS_SECHGIF_Msk      ( 0x1ul << OTG_INTSTS_SECHGIF_Pos )                    /*!< OTG_T::INTSTS: SECHGIF Mask            */

#define OTG_INTSTS_SRPDETIF_Pos     ( 13 )                                                 /*!< OTG_T::INTSTS: SRPDETIF Position       */
#define OTG_INTSTS_SRPDETIF_Msk     ( 0x1ul << OTG_INTSTS_SRPDETIF_Pos )                   /*!< OTG_T::INTSTS: SRPDETIF Mask           */

#define OTG_STATUS_OVERCUR_Pos      ( 0 )                                                  /*!< OTG_T::STATUS: OVERCUR Position        */
#define OTG_STATUS_OVERCUR_Msk      ( 0x1ul << OTG_STATUS_OVERCUR_Pos )                    /*!< OTG_T::STATUS: OVERCUR Mask            */

#define OTG_STATUS_IDSTS_Pos        ( 1 )                                                  /*!< OTG_T::STATUS: IDSTS Position          */
#define OTG_STATUS_IDSTS_Msk        ( 0x1ul << OTG_STATUS_IDSTS_Pos )                      /*!< OTG_T::STATUS: IDSTS Mask              */

#define OTG_STATUS_SESSEND_Pos      ( 2 )                                                  /*!< OTG_T::STATUS: SESSEND Position        */
#define OTG_STATUS_SESSEND_Msk      ( 0x1ul << OTG_STATUS_SESSEND_Pos )                    /*!< OTG_T::STATUS: SESSEND Mask            */

#define OTG_STATUS_BVLD_Pos         ( 3 )                                                  /*!< OTG_T::STATUS: BVLD Position           */
#define OTG_STATUS_BVLD_Msk         ( 0x1ul << OTG_STATUS_BVLD_Pos )                       /*!< OTG_T::STATUS: BVLD Mask               */

#define OTG_STATUS_AVLD_Pos         ( 4 )                                                  /*!< OTG_T::STATUS: AVLD Position           */
#define OTG_STATUS_AVLD_Msk         ( 0x1ul << OTG_STATUS_AVLD_Pos )                       /*!< OTG_T::STATUS: AVLD Mask               */

#define OTG_STATUS_VBUSVLD_Pos      ( 5 )                                                  /*!< OTG_T::STATUS: VBUSVLD Position        */
#define OTG_STATUS_VBUSVLD_Msk      ( 0x1ul << OTG_STATUS_VBUSVLD_Pos )                    /*!< OTG_T::STATUS: VBUSVLD Mask            */

#define OTG_STATUS_ASPERI_Pos       ( 6 )                                                  /*!< OTG_T::STATUS: ASPERI Position         */
#define OTG_STATUS_ASPERI_Msk       ( 0x1ul << OTG_STATUS_ASPERI_Pos )                     /*!< OTG_T::STATUS: ASPERI Mask             */

#define OTG_STATUS_ASHOST_Pos       ( 7 )                                                  /*!< OTG_T::STATUS: ASHOST Position         */
#define OTG_STATUS_ASHOST_Msk       ( 0x1ul << OTG_STATUS_ASHOST_Pos )                     /*!< OTG_T::STATUS: ASHOST Mask             */

/**@}*/ /* OTG_CONST */
/**@}*/ /* end of OTG register group */
/**@}*/ /* end of REGISTER group */



#endif /* __OTG_REG_H__ */
